InformationRegisters/КСУ_ДоступКGoogleКалендарю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КСУ_ДоступКGoogleКалендарю</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Календари</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТокенОбновления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарьВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/КСУ_ДоступККалендарю/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗапроситьДоступGoogle(Команда)
	ДанныеПроекта = ИА_КСУОбщийСервер.ПолучитьДанныеПроектаКСУ();
	Параметры1 = "response_type=code&client_id=" + ДанныеПроекта.client_id + "&redirect_uri=urn:ietf:wg:oauth:2.0:oob:auto&access_type=offline&scope=https://www.googleapis.com/auth/calendar https://www.googleapis.com/auth/calendar.events";
	ПолныйАдресАвторизации = "https://accounts.google.com/o/oauth2/auth?" + Параметры1;
	Браузер = ПолныйАдресАвторизации;
КонецПроцедуры

&НаКлиенте
Процедура БраузерДокументСформирован(Элемент)
	тт = Элементы.Браузер.документ.title;
	
	ПозКода = найти(тт,"Success code=");
	Если ПозКода = 0 Тогда
		Возврат;
	КонецЕсли;

	КодДоступа = СтрЗаменить(тт, "Success code=",""); 
	ДанныеПроекта = ИА_КСУОбщийСервер.ПолучитьДанныеПроектаКСУ();
	
	ПараметрыPOST = "grant_type=authorization_code&code=" + КодДоступа + "&client_id=" + ДанныеПроекта.client_id + "&client_secret=" + ДанныеПроекта.client_secret + "&redirect_uri=urn:ietf:wg:oauth:2.0:oob:auto";	
	хеадерс = новый Соответствие;
	хеадерс.Вставить("Content-Type","application/x-www-form-urlencoded");

	Соединение = Новый HTTPСоединение("www.googleapis.com", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 
	Запрос = Новый HTTPЗапрос("/oauth2/v4/token", хеадерс);

	Запрос.УстановитьТелоИзСтроки(ПараметрыPOST, КодировкаТекста.Системная);
    Результат = Соединение.ОтправитьДляОбработки(Запрос);
	ТекстОтвета = Результат.ПолучитьТелоКакСтроку();
	
	JSon = Новый ЧтениеJSON;
	JSon.УстановитьСтроку(ТекстОтвета);
	рез = ПрочитатьJSON(JSon);
	
	refresh_token = рез.refresh_token;
	access_token = рез.access_token;
	
	Браузер = "<html><b>Доступ получен!</b></html>";
	
	// Заполним календари
	Календари.Очистить();
	Запрос.АдресРесурса = "calendar/v3/users/me/calendarList";
	Запрос.Заголовки["Authorization"] = "Bearer " + access_token;
		
	ОтветHTTP = Соединение.Получить(Запрос);
	ТекстОтвета = ОтветHTTP.ПолучитьТелоКакСтроку();
		
	Если ОтветHTTP.КодСостояния = 200 Тогда		
		JSon = Новый ЧтениеJSON;
		JSon.УстановитьСтроку(ТекстОтвета);
		рез = ПрочитатьJSON(JSon);
		Для каждого стр из рез.items Цикл
			идКалендаря = стр.id;
			Новстр = Календари.Добавить();
			новстр.Название = идКалендаря;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьТокен(токен, календариМасс,КалендВыгр)
	мен = РегистрыСведений.КСУ_ДоступКGoogleКалендарю.СоздатьМенеджерЗаписи();
	мен.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	мен.Токен = токен;
	мен.Календари = ЗначениеВСтрокуВнутр(календариМасс);
	мен.КалендарьВыгрузки = КалендВыгр;
	мен.Записать(истина);
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	Если refresh_token = "" ТОгда
		ПоказатьПредупреждение(,"Сначала получите доступ");
		возврат;
	КонецЕсли;
	
	ВыбКал = новый массив;
	КалендВыгр = "";
	Для каждого стр из Календари Цикл
		Если стр.Выбрать ТОгда
			ВыбКал.Добавить(стр.Название);
		КонецЕсли;
		Если стр.ВыгружатьЗадачиИзКСУ Тогда
			КалендВыгр = стр.Название;
		КонецЕсли;
	КонецЦикла;
	УстановитьТокен(refresh_token,ВыбКал,КалендВыгр); 
	Элементы.Синхронизировать.Доступность = истина;
КонецПроцедуры

&НаКлиенте
Процедура Синхронизировать(Команда)
	СинхронизироватьСерв();	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СинхронизироватьСерв()
	ИА_Планы.СинхронизироватьКалендариГугл(истина);
КонецПроцедуры

&НаКлиенте
Процедура КалендариВыгружатьЗадачиИзКСУПриИзменении(Элемент)
	текД = Элементы.Календари.ТекущиеДанные;
	
	для каждого стр из Календари Цикл
		Если стр.Название<>текД.Название Тогда
			стр.ВыгружатьЗадачиИзКСУ = ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
